.emacs.d/config.org
#+TITLE: My Emacs Configuration
#+AUTHOR: Konstantin D. Schneider
#+AUTO_TANGLE: t
#+PROPERTY: header-args :tangle init.el

* Table of Contents
  :PROPERTIES:
  :TOC:      :include all :depth 2
  :END:
  
:CONTENTS:
- [[#table-of-contents][Table of Contents]]
- [[#system-settings][System Settings]]
- [[#package-management][Package Management]]
  - [[#setup-package-archives][Setup Package Archives]]
  - [[#use-package][Use-Package]]
  - [[#update-packages][Update Packages]]
- [[#keyboard-bindings][Keyboard bindings]]
  - [[#leader-bindings-with-generalel][Leader Bindings with general.el]]
  - [[#global-keybindings][Global Keybindings]]
  - [[#mode-specific-keybindings][Mode specific Keybindings]]
  - [[#keybinding-panel][Keybinding Panel]]
  - [[#becoming-evil][Becoming Evil]]
  - [[#stateful-keymaps-with-hydra][Stateful Keymaps with Hydra]]
- [[#general-configuration][General Configuration]]
  - [[#user-interface][User Interface]]
  - [[#visuals][Visuals]]
  - [[#dashboard][Dashboard]]
  - [[#emojis][Emojis]]
  - [[#helpful][Helpful]]
  - [[#command-log-mode][Command log mode]]
  - [[#notifications][Notifications]]
- [[#editor-configuration][Editor Configuration]]
  - [[#tab-width][Tab Width]]
  - [[#commenting-lines][Commenting Lines]]
  - [[#origami-for-code-folding][Origami for Code Folding]]
  - [[#highlight-matching-braces][Highlight Matching Braces]]
  - [[#commenting-lines][Commenting Lines]]
  - [[#set-margins-for-modes][Set Margins for Modes]]
- [[#completionselection-system][Completion/Selection System]]
  - [[#ivy][Ivy]]
  - [[#counsel][Counsel]]
  - [[#company][Company]]
- [[#file-browsing][File Browsing]]
  - [[#dired][Dired]]
  - [[#open-files-externally][Open Files Externally]]
  - [[#treemacs][Treemacs]]
- [[#org-mode][Org Mode]]
  - [[#general-configuration][General Configuration]]
  - [[#bullets][Bullets]]
  - [[#block-templates][Block Templates]]
  - [[#fonts--faces][Fonts & Faces]]
  - [[#table-of-contents][Table of Contents]]
  - [[#org-roam][Org Roam]]
  - [[#agenda][Agenda]]
- [[#project-management][Project Management]]
  - [[#projectile][Projectile]]
  - [[#search-with-ripgrep][Search with ripgrep]]
  - [[#git][Git]]
- [[#ide][IDE]]
  - [[#lsp][LSP]]
  - [[#polymode][Polymode]]
  - [[#ess][ESS]]
- [[#apps][Apps]]
  - [[#social][Social]]
  - [[#web-browser][Web Browser]]
  - [[#e-mail][e-Mail]]
:END:



* System Settings
  
 - [ ] macOS & Linux variables 
  
* Package Management
** Setup Package Archives
   
#+begin_src emacs-lisp

  (require 'package)
  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
			   ;; ("org" . "https://orgmode.org/elpa/")
			   ("elpa" . "https://elpa.gnu.org/packages/")))

  (package-initialize)

  (unless package-archive-contents
    (package-refresh-contents))

  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))

#+end_src

** Use-Package

   TODO Add support for automated system binary installation.
   
#+begin_src emacs-lisp

  (require 'use-package)
  (setq use-package-always-ensure t)

#+end_src

** Update Packages

#+begin_src emacs-lisp

  (use-package auto-package-update
    :custom
    (auto-package-update-interval 7)
    (auto-package-update-prompt-before-update t)
    (auto-package-update-hide-results t)
    (auto-package-update-show-preview t)
    (auto-package-update-delete-old-versions t)
    :config
    (auto-package-update-at-time "09:00")
    (auto-package-update-maybe))

#+end_src

* Keyboard bindings
** Leader Bindings with general.el

The keybindings of my config are mostly set using the package general.el. This makes it easy to use a custom leader key (SPC).

#+begin_src emacs-lisp

  (use-package general
    :config
    (general-create-definer kds/spc-leader
      :keymaps '(normal insert visual emacs)
      :prefix "SPC"
      :global-prefix "C-SPC")
    (general-create-definer kds/ctrl-c-keys
      :prefix "C-c"))

#+end_src
   
** Global Keybindings
*** TODO File Browsing
**** Files
**** Projects
*** TODO Git
*** TODO Window Management
*** TODO Buffers
*** ESC Cancels all
    
#+begin_src emacs-lisp

  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)

#+end_src

*** Super/Meta Key

#+begin_src emacs-lisp

  (defconst IS-MAC     (eq system-type 'darwin))
  (defconst IS-LINUX   (eq system-type 'gnu/linux))
  (defconst IS-WINDOWS (memq system-type '(cygwin windows-nt ms-dos)))
  (defconst IS-BSD     (or IS-MAC (eq system-type 'berkeley-unix)))

  (cond
   (IS-MAC
    (setq mac-command-modifier      'super
    ns-command-modifier       'super
    mac-option-modifier       'meta
    ns-option-modifier        'meta
    mac-right-option-modifier 'none
    ns-right-option-modifier  'none))
   (IS-WINDOWS
    (setq w32-lwindow-modifier 'super
    w32-rwindow-modifier 'super)))

#+end_src

*** UI Toggles

#+begin_src emacs-lisp

  (kds/spc-leader
    "t" '(:ignore t :which-key "toggles")
    "tw" '(whitespace-mode :which-key "whitespace")
    "tt" '(counsel-load-theme :which-key "choose theme")
    "te" '(global-emojify-mode :which-key "emojis"))

#+end_src

*** TRAMP

#+begin_src emacs-lisp

  (setq tramp-default-method "ssh")

#+end_src

** TODO Mode specific Keybindings
*** TODO Code
*** TODO Org
** Keybinding Panel
  
#+begin_src emacs-lisp

  (use-package which-key
    :init (which-key-mode)
    :diminish which-key-mode
    :config
    (setq which-key-idle-delay 0.3))

#+end_src

** Becoming Evil
*** Evil Mode

#+begin_src emacs-lisp

  (use-package evil
    :init
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-want-C-u-scroll t)
    (setq evil-want-C-i-jump nil)
    (setq evil-respect-visual-line-mode t)
    (setq evil-undo-system 'undo-tree)

    :config
    (evil-mode 1)
    (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
    (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

    ;; Use visual line motions even outside of visual-line-mode buffers
    (evil-global-set-key 'motion "j" 'evil-next-visual-line)
    (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

    (defun kds/dont-arrow-me-bro ()
      (interactive)
      (message "Arrows are bad, ma dude.."))

    ;; Disable arrow keys in normal and visual modes
    (define-key evil-normal-state-map (kbd "<left>") 'kds/dont-arrow-me-bro)
    (define-key evil-normal-state-map (kbd "<right>") 'kds/dont-arrow-me-bro)
    (define-key evil-normal-state-map (kbd "<down>") 'kds/dont-arrow-me-bro)
    (define-key evil-normal-state-map (kbd "<up>") 'kds/dont-arrow-me-bro)
    (evil-global-set-key 'motion (kbd "<left>") 'kds/dont-arrow-me-bro)
    (evil-global-set-key 'motion (kbd "<right>") 'kds/dont-arrow-me-bro)
    (evil-global-set-key 'motion (kbd "<down>") 'kds/dont-arrow-me-bro)
    (evil-global-set-key 'motion (kbd "<up>") 'kds/dont-arrow-me-bro)

    (evil-set-initial-state 'messages-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-mode 'normal))

#+end_src

*** Evil Collection
    
#+begin_src emacs-lisp

  (use-package evil-collection
    :after evil
    :config
    (evil-collection-init))

#+end_src

*** Undo Tree

#+begin_src emacs-lisp

  (use-package undo-tree
    :config (global-undo-tree-mode))

#+end_src

*** Rebind C-u

   Since I let evil-mode take over C-u for buffer scrolling, I need to re-bind the universal-argument command to another key sequence. I’m choosing C-M-u for this purpose.

#+begin_src emacs-lisp

  (global-set-key (kbd "C-M-u") 'universal-argument)

#+end_src

** Stateful Keymaps with Hydra
  
#+begin_src emacs-lisp

  (use-package hydra)

#+end_src

* General Configuration
** User Interface
*** More Minimalism

#+begin_src emacs-lisp

  (setq inhibit-startup-message t)

  (scroll-bar-mode 0)
  (tool-bar-mode 0)
  (tooltip-mode 0)

  (set-fringe-mode 10)
  (set-frame-parameter nil 'internal-border-width 10)

  (menu-bar-mode -1)

  (setq visible-bell t)

#+end_src

*** Better Scrolling

#+begin_src emacs-lisp

  (setq mouse-wheel-scroll-amount '(1 ((shift) . 1)))  ; one line at a time
  (setq mouse-wheel-progressive-speed nil)             ; don't accelerate scrolling
  (setq mouse-wheel-follow-mouse 't)                   ; scroll window under mouse
  (setq scroll-step 1) ; keyboard scroll one line at a time
  (setq use-dialog-box nil) ; Disable dialog boxes since they weren't working in Mac OSX

#+end_src

*** Frame Defaults

#+begin_src emacs-lisp

  (set-frame-parameter (selected-frame) 'alpha '(85 . 85))
  (add-to-list 'default-frame-alist '(alpha . (85 . 85)))
   ;;(set-frame-parameter (selected-frame) 'fullscreen 'maximized)
   ;;(add-to-list 'default-frame-alist '(fullscreen . maximized))

#+end_src

** Visuals
*** Font

#+begin_src emacs-lisp

  (set-face-attribute 'default nil
		      :font "FiraCode Nerd Font Mono"
		      :weight 'light
		      :height 200)

  (set-face-attribute 'fixed-pitch nil
		      :font "FiraCode Nerd Font Mono"
		      :weight 'light
		      :height 200)

  (set-face-attribute 'variable-pitch nil
		      :font "FiraCode Nerd Font"
		      :weight 'light
		      :height 200)

#+end_src
 
*** Theme
**** Doom Themes
  
#+begin_src emacs-lisp

  (use-package doom-themes
    :config
    (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
          doom-themes-enable-italic t) ; if nil, italics is universally disabled
    (doom-themes-visual-bell-config)
    (setq doom-themes-treemacs-theme "doom-atom") ; use "doom-colors" for less minimal icon theme
    (doom-themes-treemacs-config)
    (doom-themes-org-config))

#+end_src

**** Zenburn

#+begin_src emacs-lisp

  (use-package zenburn-theme)

#+end_src

**** Load Theme
     
#+begin_src emacs-lisp

  (load-theme 'doom-dracula t)

#+end_src
 
