.emacs.d/init.el
(require 'package)
(setq package-archives '(("melpa" . "https://melpa.org/packages/")
			 ;; ("org" . "https://orgmode.org/elpa/")
			 ("elpa" . "https://elpa.gnu.org/packages/")))

(package-initialize)

(unless package-archive-contents
  (package-refresh-contents))

(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))

(require 'use-package)
(setq use-package-always-ensure t)

(use-package auto-package-update
  :custom
  (auto-package-update-interval 7)
  (auto-package-update-prompt-before-update t)
  (auto-package-update-hide-results t)
  (auto-package-update-show-preview t)
  (auto-package-update-delete-old-versions t)
  :config
  (auto-package-update-at-time "09:00")
  (auto-package-update-maybe))

(use-package general
  :config
  (general-create-definer kds/spc-leader
    :keymaps '(normal insert visual emacs)
    :prefix "SPC"
    :global-prefix "C-SPC")
  (general-create-definer kds/ctrl-c-keys
    :prefix "C-c"))

(global-set-key (kbd "<escape>") 'keyboard-escape-quit)

(defconst IS-MAC     (eq system-type 'darwin))
(defconst IS-LINUX   (eq system-type 'gnu/linux))
(defconst IS-WINDOWS (memq system-type '(cygwin windows-nt ms-dos)))
(defconst IS-BSD     (or IS-MAC (eq system-type 'berkeley-unix)))

(cond
 (IS-MAC
  (setq mac-command-modifier      'super
  ns-command-modifier       'super
  mac-option-modifier       'meta
  ns-option-modifier        'meta
  mac-right-option-modifier 'none
  ns-right-option-modifier  'none))
 (IS-WINDOWS
  (setq w32-lwindow-modifier 'super
  w32-rwindow-modifier 'super)))

(kds/spc-leader
  "t" '(:ignore t :which-key "toggles")
  "tw" '(whitespace-mode :which-key "whitespace")
  "tt" '(counsel-load-theme :which-key "choose theme")
  "te" '(global-emojify-mode :which-key "emojis"))

(setq tramp-default-method "ssh")

(use-package which-key
  :init (which-key-mode)
  :diminish which-key-mode
  :config
  (setq which-key-idle-delay 0.3))

(use-package evil
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-want-C-u-scroll t)
  (setq evil-want-C-i-jump nil)
  (setq evil-respect-visual-line-mode t)
  (setq evil-undo-system 'undo-tree)

  :config
  (evil-mode 1)
  (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
  (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

  ;; Use visual line motions even outside of visual-line-mode buffers
  (evil-global-set-key 'motion "j" 'evil-next-visual-line)
  (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

  (defun kds/dont-arrow-me-bro ()
    (interactive)
    (message "Arrows are bad, ma dude.."))

  ;; Disable arrow keys in normal and visual modes
  (define-key evil-normal-state-map (kbd "<left>") 'kds/dont-arrow-me-bro)
  (define-key evil-normal-state-map (kbd "<right>") 'kds/dont-arrow-me-bro)
  (define-key evil-normal-state-map (kbd "<down>") 'kds/dont-arrow-me-bro)
  (define-key evil-normal-state-map (kbd "<up>") 'kds/dont-arrow-me-bro)
  (evil-global-set-key 'motion (kbd "<left>") 'kds/dont-arrow-me-bro)
  (evil-global-set-key 'motion (kbd "<right>") 'kds/dont-arrow-me-bro)
  (evil-global-set-key 'motion (kbd "<down>") 'kds/dont-arrow-me-bro)
  (evil-global-set-key 'motion (kbd "<up>") 'kds/dont-arrow-me-bro)

  (evil-set-initial-state 'messages-buffer-mode 'normal)
  (evil-set-initial-state 'dashboard-mode 'normal))

(use-package evil-collection
  :after evil
  :config
  (evil-collection-init))

(use-package undo-tree
  :config (global-undo-tree-mode))

(global-set-key (kbd "C-M-u") 'universal-argument)

(use-package hydra)

(setq inhibit-startup-message t)

(scroll-bar-mode 0)
(tool-bar-mode 0)
(tooltip-mode 0)

(set-fringe-mode 10)
(set-frame-parameter nil 'internal-border-width 10)

(menu-bar-mode -1)

(setq visible-bell t)

(setq mouse-wheel-scroll-amount '(1 ((shift) . 1)))  ; one line at a time
(setq mouse-wheel-progressive-speed nil)             ; don't accelerate scrolling
(setq mouse-wheel-follow-mouse 't)                   ; scroll window under mouse
(setq scroll-step 1) ; keyboard scroll one line at a time
(setq use-dialog-box nil) ; Disable dialog boxes since they weren't working in Mac OSX

(set-frame-parameter (selected-frame) 'alpha '(85 . 85))
(add-to-list 'default-frame-alist '(alpha . (85 . 85)))
 ;;(set-frame-parameter (selected-frame) 'fullscreen 'maximized)
 ;;(add-to-list 'default-frame-alist '(fullscreen . maximized))

(set-face-attribute 'default nil
		    :font "FiraCode Nerd Font Mono"
		    :weight 'light
		    :height 200)

(set-face-attribute 'fixed-pitch nil
		    :font "FiraCode Nerd Font Mono"
		    :weight 'light
		    :height 200)

(set-face-attribute 'variable-pitch nil
		    :font "FiraCode Nerd Font"
		    :weight 'light
		    :height 200)

(use-package doom-themes
  :config
  (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
        doom-themes-enable-italic t) ; if nil, italics is universally disabled
  (doom-themes-visual-bell-config)
  (setq doom-themes-treemacs-theme "doom-atom") ; use "doom-colors" for less minimal icon theme
  (doom-themes-treemacs-config)
  (doom-themes-org-config))

(use-package zenburn-theme)

(load-theme 'doom-dracula t)
