.emacs.d/config.org
*** Modeline
   
#+begin_src emacs-lisp

  (use-package doom-modeline
    :init (doom-modeline-mode 1)
    :config
    (setq doom-modeline-height 18)
    (setq doom-modeline-bar-width 4)
    (setq doom-modeline-hud nil)
    (setq doom-modeline-window-width-limit fill-column)
    (setq doom-modeline-project-detection 'projectile)
    (setq doom-modeline-buffer-file-name-style 'name)
    (setq doom-modeline-major-mode-icon t)
    (setq doom-modeline-major-mode-color-icon t)
    (setq doom-modeline-buffer-state-icon t)
    (setq doom-modeline-buffer-modification-icon t)
    (setq doom-modeline-minor-modes nil)
    (setq doom-modeline-enable-word-count t)
    (setq doom-modeline-continuous-word-count-modes '(text-mode markdown-mode org-mode))
    (setq doom-modeline-lsp t))

#+end_src

*** Icons
  
#+begin_src emacs-lisp

  (use-package all-the-icons)

#+end_src
  
** Dashboard

#+begin_src emacs-lisp

  (use-package dashboard
    :init
    (setq dashboard-set-heading-icons t)
    (setq dashboard-set-file-icons t)
    (setq dashboard-banner-logo-title nil)
    (setq dashboard-project-backend 'projectile)
    (setq dashboard-center-content t)
    (setq dashboard-items '((recents . 5)
                            (agenda . 5)
                            (bookmarks . 3)
                            (projects . 3)))
    (setq dashboard-startup-banner 'logo)
    (setq dashboard-set-navigator t)
    :config
    (dashboard-setup-startup-hook))

#+end_src
   
** Emojis

#+begin_src emacs-lisp

  (use-package emojify
    :hook erc-mode)

#+end_src

** Helpful
  
#+begin_src emacs-lisp

  (use-package helpful
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    :bind
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key))

#+end_src

** Command log mode
  
#+begin_src emacs-lisp

  (use-package command-log-mode)

#+end_src

** Notifications
*** System Notifications

#+begin_src emacs-lisp

  (use-package alert
    :custom alert-default-style 'notifications)

#+end_src

*** Emacs Warnings

#+begin_src emacs-lisp

  (setq large-file-warning-threshold nil)
  ;;(setq vc-follow-symlinks t)
  (setq ad-redefinition-action 'accept)

#+end_src
    
** Auto-Save Changed Files

#+begin_src emacs-lisp

  (setq auto-save-default nil)

  (use-package super-save
    :config
    (super-save-mode +1)
    (setq super-save-auto-save-when-idle t))

#+end_src

* Editor Configuration
** Word Wrap

#+begin_src emacs-lisp

  (visual-line-mode 1)

#+end_src

** Tab Width
   
#+begin_src emacs-lisp

  (setq-default tab-width 2)
  (setq-default evil-shift-width tab-width)

#+end_src

#+begin_src emacs-lisp

	(setq-default indent-tabs-mode nil)

#+end_src

** Commenting Lines

   WORK IN PROGRESS
   
** Origami for Code Folding

#+begin_src emacs-lisp

	(use-package origami
		:hook yaml-mode)

#+end_src

** Highlight Matching Braces

#+begin_src emacs-lisp

  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))

#+end_src

** Commenting Lines

#+begin_src emacs-lisp

  (use-package evil-nerd-commenter)

#+end_src
  
** Set Margins for Modes

#+begin_src emacs-lisp

      (defun kds/org-mode-visual-fill ()
        (interactive)
        (setq visual-fill-column-width 100
              visual-fill-column-center-text t)
        (visual-fill-column-mode 1))

      (use-package visual-fill-column
        :hook (org-mode . kds/org-mode-visual-fill))

#+end_src

** Line numbers
*** Show Column Number in Modeline
    
#+begin_src emacs-lisp

  (column-number-mode 1)

#+end_src

*** Enable Linenumbers for specific modes

#+begin_src emacs-lisp

  ;; Enable line numbers for some modes
  (dolist (mode '(text-mode-hook
		  prog-mode-hook
		  conf-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 1))))

  ;; Override some modes which derive from the above
  (dolist (mode '(org-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))

#+end_src

* Completion/Selection System
** Ivy
  
#+begin_src emacs-lisp

  (use-package ivy
    :diminish
    :config
    (ivy-mode 1))

#+end_src

#+begin_src emacs-lisp

  (use-package ivy-rich
    :after ivy
    :init
    (ivy-rich-mode 1))

#+end_src

** Counsel
  
#+begin_src emacs-lisp

  (use-package counsel
    :bind
    (("M-x" . counsel-M-x)
     ("C-x C-b" . counsel-switch-buffer)
     ("C-x C-f" . counsel-find-file)))

#+end_src

** Company

#+begin_src emacs-lisp

  (use-package company)

#+end_src

* File Browsing
** TODO Dired

#+begin_src emacs-lisp

  (use-package all-the-icons-dired)
  (use-package dired-single)
  (use-package dired-ranger)
  (use-package dired-collapse)

  (setq dired-listing-switches "-agho --group-directories-first"
	dired-omit-files "^\\.[^.].*"
	dired-omit-verbose nil
	dired-hide-details-hide-symlink-targets nil
	delete-by-moving-to-trash t)

  (autoload 'dired-omit-mode "dired-x")

  (add-hook 'dired-load-hook
	    (lambda ()
	      (interactive)
	      (dired-collapse)))

  (add-hook 'dired-mode-hook
	    (lambda ()
	      (interactive)
	      (dired-omit-mode 1)
	      (dired-hide-details-mode 1)
	      (all-the-icons-dired-mode 1))
	      (hl-line-mode 1))

  (evil-collection-define-key 'normal 'dired-mode-map
    "h" 'dired-single-up-directory
    "H" 'dired-omit-mode
    "l" 'dired-single-buffer
    "y" 'dired-ranger-copy
    "X" 'dired-ranger-move
    "p" 'dired-ranger-paste)

#+end_src

** TODO Open Files Externally
   
** Treemacs

#+begin_src emacs-lisp

  (use-package treemacs)

#+end_src
  
* Org Mode
