.emacs.d/config.org
** General Configuration
   
#+begin_src emacs-lisp

  ;; This is ugly af and keeps breaking.
  ;; TODO: Try to org-modules on their own.
  (defun kds/org-mode-setup ()
    (interactive)
    (org-indent-mode)
    (variable-pitch-mode 1)
    (auto-fill-mode 0)
    (visual-line-mode 1)
    (setq evil-auto-mode 1))
  ;; (diminish org-indent-mode))           


  (use-package org
    :hook (kds/org-mode-setup)
    :config
    (setq org-ellipsis " ▾")
    (setq org-agenda-files '("~/Cloud/org/agenda"))
    (setq org-hide-emphasis-markers t)
    (setq org-src-fontify-natively t)
    (setq org-fontify-quote-and-verse-blocks t)
    (setq org-src-tab-acts-natively t)
    (setq org-hide-block-startup nil)
    (setq org-src-preserve-indentation nil)
    (setq org-startup-folded t)
    (setq org-cycle-separator-lines 2)
    (setq org-capture-bookmark nil)

    ;; Org Modules
    (setq org-modules '(org-crypt
                        org-habit
                        org-bookmark
                        org-eshell
                        org-irc
                        org-indent
                        org-tempo))

    (setq org-outline-path-complete-in-steps nil)
    (setq org-refile-use-outline-path t)

    (evil-define-key '(normal insert visual) org-mode-map (kbd "C-j") 'org-next-visible-heading)
    (evil-define-key '(normal insert visual) org-mode-map (kbd "C-k") 'org-previous-visible-heading)

    (evil-define-key '(normal insert visual) org-mode-map (kbd "M-j") 'org-metadown)
    (evil-define-key '(normal insert visual) org-mode-map (kbd "M-k") 'org-metaup)

    ;; Structure Templates
    (add-to-list 'org-structure-template-alist '("sh" . "src sh"))
    (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
    (add-to-list 'org-structure-template-alist '("li" . "src lisp"))
    (add-to-list 'org-structure-template-alist '("py" . "src python"))
    (add-to-list 'org-structure-template-alist '("r" . "src r"))

    ;; Fonts and Faces
    (set-face-attribute 'org-document-title nil
                        :font "FiraCode Nerd Font"
                        :weight 'bold
                        :height 1.3)

    (dolist (face '((org-level-1 . 1.2)
                    (org-level-2 . 1.1)
                    (org-level-3 . 1.05)
                    (org-level-4 . 1.0)
                    (org-level-5 . 1.1)
                    (org-level-6 . 1.1)
                    (org-level-7 . 1.1)
                    (org-level-8 . 1.1)))
      (set-face-attribute (car face) nil
                          :font "FiraCode Nerd Font"
                          :weight 'medium
                          :height (cdr face)))

    ;; ;; Ensure that anything that should be fixed-pitch in Org files appears that way
    ;; (set-face-attribute 'org-block nil
    ;;                     :foreground nil
    ;;                     :inherit 'fixed-pitch)
    ;; (set-face-attribute 'org-table nil
    ;;                     :inherit 'fixed-pitch)
    ;; (set-face-attribute 'org-formula nil
    ;;                     :inherit 'fixed-pitch)
    ;; (set-face-attribute 'org-code nil
    ;;                     :inherit '(shadow fixed-pitch))
    ;; ;;(set-face-attribute 'org-indent nil
    ;; ;;                    :inherit '(org-hide fixed-pitch))
    ;; (set-face-attribute 'org-verbatim nil
    ;;                     :inherit '(shadow fixed-pitch))
    ;; (set-face-attribute 'org-special-keyword nil
    ;;                     :inherit '(font-lock-comment-face fixed-pitch))
    ;; (set-face-attribute 'org-meta-line nil
    ;;                     :inherit '(font-lock-comment-face fixed-pitch))
    ;; (set-face-attribute 'org-checkbox nil
    ;;                     :inherit 'fixed-pitch)

    ;; ;; Get rid of the background on column views
    ;; (set-face-attribute 'org-column nil
    ;;                     :background nil)
    ;; (set-face-attribute 'org-column-title nil
    ;;                     :background nil))
    )

#+end_src

** Bullets

#+begin_src emacs-lisp

  (use-package org-superstar
    :after org
    :hook (org-mode . org-superstar-mode)
    :config
    (setq org-superstar-leading-bullet ?\s
          org-superstar-leading-fallback ?\s
          org-hide-leading-stars nil
          org-superstar-headline-bullets-list '("◉" "○" "●" "○" "●" "○" "●")))

#+end_src

** Create ToC automatically 

#+begin_src emacs-lisp

  (use-package org-make-toc
    :after org)

#+end_src

** Org Roam
   
#+begin_src emacs-lisp

  (use-package org-roam
    :after org
    :init
    (setq org-roam-v2-ack t)
    :custom
    (org-roam-directory "~/Cloud/org")
    :bind (("C-c n l" . org-roam-buffer-toggle)
           ("C-c n f" . org-roam-node-find)
           ("C-c n i" . org-roam-node-insert))
    :config
    (org-roam-setup))

#+end_src

** Auto-Tangle on Save

#+begin_src emacs-lisp

  (use-package org-auto-tangle
    :hook (org-mode . org-auto-tangle-mode))

#+end_src

* Project Management
** Projectile
  
#+begin_src emacs-lisp

  (use-package projectile
    :diminish projectile-mode
    :config (projectile-mode)
    :custom ((projectile-completion-system 'ivy))
    :bind-keymap
    ("C-c p" . projectile-command-map)
    :init
    (setq projectile-project-search-path '("~/"))
    (setq projectile-switch-project-action #'projectile-dired))

  (use-package counsel-projectile
    :config (counsel-projectile-mode))

#+end_src

#+begin_src emacs-lisp
  
  (kds/spc-leader
  "p" '(projectile-command-map :which-key "projectile"))
  
  (kds/spc-leader
  "b" '(:ignore t :which-key "buffer")
  "bb" '(counsel-switch-buffer :which-key "switch buffer"))
  
  (kds/spc-leader
  "w" '(:ignore t :which-key "window")
  "ww" '(evil-window-next :which-key "next window")
  "wc" '(evil-window-close :which-key "close window"))
  
#+end_src

** Search with ripgrep

#+begin_src emacs-lisp

  (use-package rg)
  
#+end_src

** Git
*** Magit
   
#+begin_src emacs-lisp

  (use-package magit)

#+end_src

*** Forge
   
#+begin_src emacs-lisp

  (use-package forge
    :after magit
    :disabled)

#+end_src

* IDE 
** LSP

#+begin_src emacs-lisp

  (use-package lsp-mode)

#+end_src
 
** Polymode

#+begin_src emacs-lisp

    (use-package polymode)
    (use-package poly-markdown)
    (use-package poly-R)

    (add-to-list 'auto-mode-alist '("\\.md" . poly-markdown-mode))
    (add-to-list 'auto-mode-alist '("\\.Rmd" . poly-R-mode))

#+end_src

** Languages
*** R

#+begin_src emacs-lisp

  (use-package ess)

#+end_src


 #+end_src

** ESS

#+begin_src emacs-lisp

  (use-package ess)

#+end_src

* Apps
** Web Browser

#+begin_src emacs-lisp

  (use-package eww)

#+end_src
